<?php
/**
 * Скрипт: Конструктор видео v3.x для DLE
 * Назначение файла: Языковый файл
 * @author SeregaL <SeregaL2009@yandex.ru>
 * 
 * Скрипт сгенерирован специально для: {%loader(EMAIL)%}
 */

$vclang = array (
	
	// Проверка сервера
	"serv_check_isset" => "Проверка доступности сервера",
	"pseudo_ping" => "Псевдопинг сервера",
	"serv_response_check" => "Проверка ответа сервера",
	"serv_not_answered" => "Сервер не ответил",
	"serv_answer_time" => "Время ответа сервера",
	"response_check" => "Проверка отправки запроса",
	"Success" => "Успешно",
	"vk_not_auth" => "Не авторизован Вконтакте",
	"secret_incorrect" => "Ключ авторизации не правильный",
	"Not_success" => "Не успешно",
	
	// Разделы админки
	'h_info' => 'Информация',
    'h_check' => 'Проверка фильмов',
    'h_checked_films' => 'Результаты проверки',
    'h_complaints' => 'Жалобы',
    'h_properties' => 'Настройки',
    'h_extensions' => 'Расширения',
    'h_help' => 'Справка',
	
	"constructor_title" => "Парсер-конструктор Видео Вконтакте",
	
	// Раздел информации
	"clear_cache" => "Очистить",
	"search_server" => "Поисковый сервер",
	"do_serv_check" => "проверка",
	"info_about_program" => "Информация о программе",
	"info_about_cache" => "Информация о кеше",
	"current_version" => "Текущая версия",
	"z_cache" => "Кеш сборок",
	"files_in_cache" => "Файлов в кеше",
	"cache_memory" => "Занимает память",
	"actual_version" => "Акктуальная версия",
	"turned_on" => "включен",
	"turned_off" => "выключен",
	"was_not" => "не проводилась",
	"days_ago" => "дней назад",
	"stat_by_video" => "Статистика по видео",
	"stat_by_players" => "Статистика по плеерам",
	"all_z_c" => "Всего сборок видео",
	"all_s_c" => "К-во серий",
	"with_errors" => "С ошибками",
	"uncnown_tube" => "Неизвестный Tube",
	"last_check" => "Последняя проверка",
	"stat_get_time" => "Время сбора статистики",
	
	// Проверка фильмов 
	"Delay" => "Задержка",
	"Jump_videos" => "Пропуск видео",
	"clear_last_results" => "Очистить результаты предыдущей проверки",
	"without_errors" => "Без&nbsp;ошибок",
	"Deleted_s" => "Удалены",
	"Unknovn_tubes" => "Неизвестные&nbsp;тюбы",
	"Start_errors" => "Начальные&nbsp;ошибки",
	"check_tube_cant_long" => "Не поддерживается проверка для этого tube",
	"check_tube_cant_short" => "Не&nbsp;поддерживается",
	"php_js_err_long" => "Ошибка при проверке - возможно неполадки в PHP или JS",
	"php_js_err_short" => "Ошибки&nbsp;PHP/JS",
	"Searched" => "Найдено",
	"films_for_check" => "фильм(ов) для проверки",
	"filtered_as_uknown_tube" => "отфильтровано по причине: неизвестный туб",
	"set_delay_and_start" => "Установите задержку между запросами и нажмите \"Старт\"",
	"Start" => "Старт",
	"jump_video" => "пропуск видео",
	"offset_bad" => "Поле \"пропуск видео\" меньше 0 или содержит слишком большое значение!",
	
	// Результаты проверки  
	"Post" => "Новость",
	"Package" => "Сборка видео",
	"Serie" => "Серия",
	"Error" => "Ошибка",
	"Player" => "Плеер",
	"Action" => "Действие",
	"Check_all" => "Выбрать все",
	"Without_errors" => "Без ошибок",
	"Execute" => "Выполнить",
	
	// Жалобы  
	"Status" => "Статус",
	"Complaint" => "Жалоба",
	"Name" => "Имя",
	"Delete" => "Удалить",
	
	// Настройки   
	"E-mail_long" => "E-mail, к которому привязана лицензия или \"demo@ralode.com\" для режима демонстрации",
	"Lic_key" => "Лицензионный ключ",
	"Lic_key_long" => "20 символьный лицензионный ключ (из панели клиента), или \"demo\" для режима демонстрации",
	"Server_search" => "Сервер для поиска",
	"Server_search_long" => "Сервер назначается автоматически при установке или меняется по инструкциям от автора. Только домен, например",
	"Debug_mode" => "Режим отладки",
	"Debug_mode_long" => "Включать режим отладки по просьбе разработчика при возникновении проблем",
	"Serialname_patterns" => "Шаблоны названий серий",
	"Serialname_patterns_long" => "По одному шаблону на строку. В первой строке шаблон по умолчанию. Теги: {title}, {num}",
	"Default_quality" => "Стандартное качество",
	"Default_quality_long" => "Начальные настройки при добавлении/редактировании видео",
	"Series_sort" => "Сортировка серий в категории",
	"Series_sort_long" => "По возрастанию - в начале списка будут первые серии. По убыванию - в начале списка будут самие новые серии.",
	"Filter_minlen" => "Фильтр длинны видео",
	"Filter_minlen_long" => "Видео длинной меньше ... минут не будут отображаться в результатах поиска. Начальные настройки при добавлении/редактировании видео.",
	"Cache_lpayer" => "Кеш вывода плеера",
	"Cache_lpayer_long" => "Минус 2 sql-запрса до базы данных при каждом просмотре новости, разгружает сервер от однотипных вычыслительных задач.",
	"Player_config" => "Настройки плеера",
	"Player_size" => "Размеры плеера",
	"Player_size_long" => "Для большинства шаблонов вывода высота внешнего блока сериалов будет больше (из-за переключателя серий). Ширина х высота.",
	"Player_style" => "Шаблон вывода плеера",
	"Player_style_long" => "Дизайн переключателей серий. Просмотреть все доступные шаблоны можно <a href='http://ralode.com/konstruktor-video-v3-styles.html'>здесь</a>.",
	"Player_uppod_swf" => "Ссылка на плеер uppod (uppod.swf).",
	"Player_uppod_style" => "Ссылка на стиль плеера uppod (*.txt).",
	"Access_config" => "Настройки доступа",
	"Access_base" => "Базовые действия (чтение)",
	"Access_base_long" => "Просмотр разделов \"Информация\", \"Результаты проверки\", \"Жалобы\" (просмотр/удаление жалоб), \"Справка\". Это ваши модераторы, журналисты и т.д. Они не могут запускать проверку или просматривать/редактировать настройки. Поле может быть пустым.<br />
                    <b>Для добавления</b> введите через запятую список логинов пользователей и/или ID групп. Например: \"1,marina,anton,2\" - разрешит доступ группе Администраторов (ID=1), пользователям marina и anton, а также группе Главные редакторы (ID=2).",
	"Access_ext" => "Расширенные действия",
	"Access_ext_long" => "Все права, включая запуск проверки, просмотр и изменение настроек.<br />
                    Введите список через запятую, как и для предыдущего поля. <br />По умолчанию: \"1\" (Группа Администраторов).",
	"Save" => "Сохранить",
	
	// VideoConstructor class
	"server_not_available" => "сервер недоступен",
	"installed" => "установлена",
	"format_not_valid" => "формат данных не верный",
	
	// 
	"" => ""
	
);

// Справка
$vclang["help_text"] =<<<DELIM
<p><b>Автор скрипта</b>: SeregaL (<a href="mailto:SeregaL2009@yandex.ru">SeregaL2009@yandex.ru</a>)</p>
<p><b>Официальная страница скрипта</b>: <a href="http://ralode.com/konstruktor-video-v3.x">http://ralode.com/konstruktor-video-v3.x</a> . Поисковые серверы также могут быть расположены на доменах *.6prog.net .</p>
<p>Инструкцию по установке и обновлению смотрите по ссылке выше. По техническим вопросам и за поддержкой пишите в тикеты (<a href="http://ralode.com/tickets">http://ralode.com/tickets</a>).</p>
DELIM;

?>