<?php

/**
 * Скрипт: Конструктор видео v3.x для DLE
 * Назначение файла: Константы редактора в админке
 * @author SeregaL <SeregaL2009@yandex.ru>
 * 
 * Скрипт сгенерирован специально для: {%loader(EMAIL)%}
 */

$vc_constants = array (
    'onOff' => array ( // Стандартний перемикач "Включено-Отключено"
        '1' => 'Включено',
        '0' => 'Отключено'
    ),
    'qualityPrefix' => array ( // Перемикач "quality_prefix"
        'none' => 'Любое',
        'more' => 'Не более',
        'less' => 'Не менее',
        'equal' => 'Точно'
    ),
    'quality' => array ( // Перемикач "quality"
        '240' => '240',
        '360' => '360',
        '480' => '480',
        '720' => '720'
    ),
    'sortInCat' => array ( // Сортування серій в категорії
        '2' => 'По умолчанию',
        '0' => 'По возрастанию',
        '1' => 'По убыванию'
    ),
    'sortInCatConf' => array ( // Сортування серій в категорії (для налаштувань)
        '0' => 'По возрастанию',
        '1' => 'По убыванию'
    )
);

?>